#include "global.h"
#include "text.h"


/* Game Text - Tram & Pauline */


char D_0805dae0[] = "トランくん、やりなおし。";

char D_0805dafc[] = "かなり　カッコよかったぞ！";

char D_0805db18[] = "ポリンちゃん、やりなおし。";

char D_0805db34[] = "とても　ビューティフルだった！";

char D_0805db54[] = "あせったらダメ。集中してね。";

char D_0805db74[] = "すごい　アクロバティックだ！";

char D_0805db94[] = "団長のゲキ";

char D_0805dba0[] = "トラン　と、";

char D_0805dbb0[] = "ポリン　の、";

char D_0805dbc0[] = "レッツ　トランポリン！";

char D_0805dbd8[] = "てっぺんに　きたときに、";

char D_0805dbf4[] = "ぼくは　＋ボタンで、";

char D_0805dc0c[] = "あたしは　Ａボタンで、";

char D_0805dc24[] = "ヘンシン　するよ！";

char D_0805dc38[] = "ちょっと　れんしゅう　しよう！";

char D_0805dc58[] = "れんぞく　ジャンプ！";

char D_0805dc70[] = "ふたり　じゅんばんに！";

char D_0805dc88[] = "ふたり　どうじに！";

char D_0805dc9c[] = "よしっ、　ホンバンいくよ！";
