#include "global.h"
#include "text.h"


/* Game Text - Polyrhythm */


char D_0805afec[] = "ちゃんと　運んでくれないとダメ。";

char D_0805b010[] = "";

char D_0805b014[] = "左手が　あそんでるヨ。";

char D_0805b02c[] = "左手が　しっかり仕事してるネ！";

char D_0805b04c[] = "応用力を　みにつけよう。";

char D_0805b068[] = "リズミカルな　仕事ぶりだ！！";

char D_0805b088[] = "工場長から";

char D_0805b094[] = "きほんが　できてないね。";

char D_0805b0b0[] = "";

char D_0805b0b4[] = "ウラが　パッと　してない。";

char D_0805b0d0[] = "ウラが　バッチリだ！";

char D_0805b0e8[] = "ちょっと　ややこしくなると　ダメね。";

char D_0805b110[] = "左右の手が　独立してないヨ。";

char D_0805b130[] = "左右の手が　独立している！";

char D_0805b14c[] = "工場長から";
