#include "global.h"
#include "text.h"


/* Game Text - Fireworks */


char D_0805cd60[] = "もっとハデに　キメようぜ！";

char D_0805cd7c[] = "すばらしい　うちあげっぷりだ！！";

char D_0805cda0[] = "反応が　おそいぞ！";

char D_0805cdb4[] = "いい反応してるな！";

char D_0805cdc8[] = "オヤカタから　ひとこと";

char D_0805cde0[] = "・・・　おまつり　まえ　・・・";

char D_0805ce00[] = "とっくんだ！";

char D_0805ce10[] = "「ハイ！」　のあいずで　Ａボタン";

char D_0805ce34[] = "まずは、　「　ふつう　の　ハナビ　」";

char D_0805ce5c[] =
    ".b" "いち　"
    ".b" "に　"
    ".b" "さん　　"
    ".b" "ハイ！";

char D_0805ce80[] =
    ".d" "いち　"
    ".b" "に　"
    ".b" "さん　　"
    ".b" "ハイ！";

char D_0805cea4[] =
    ".d" "いち　"
    ".d" "に　"
    ".b" "さん　　"
    ".b" "ハイ！";

char D_0805cec8[] =
    ".d" "いち　"
    ".d" "に　"
    ".d" "さん　　"
    ".b" "ハイ！";

char D_0805ceec[] =
    "　"
    ".c" "いち　"
    ".c" "に　"
    ".c" "さん　"
    ".c:0" "ハイ！";

char D_0805cf10[] = "「　きあい　の　ハナビ　」";

char D_0805cf2c[] =
    ".b" "ぬ"
    ".b" "え"
    ".b" "い"
    ".b" "！　　"
    ".b" "ハイ！";

char D_0805cf4c[] =
    ".d" "ぬ"
    ".b" "え"
    ".b" "い"
    ".b" "！　　"
    ".b" "ハイ！";

char D_0805cf6c[] =
    ".d" "ぬ"
    ".d" "え"
    ".b" "い"
    ".b" "！　　"
    ".b" "ハイ！";

char D_0805cf8c[] =
    ".d" "ぬ"
    ".d" "え"
    ".d" "い"
    ".b" "！　　"
    ".b" "ハイ！";

char D_0805cfac[] =
    ".d" "ぬ"
    ".d" "え"
    ".d" "い"
    ".d" "！　　"
    ".b" "ハイ！";

char D_0805cfcc[] =
    "　"
    ".c" "ぬ"
    ".c" "え"
    ".c" "い"
    ".c" "！　"
    ".c:0" "ハイ！";

char D_0805cfec[] = "「　シメ　の　タイコボンバー　」";

char D_0805d010[] =
    ".b" "た"
    ".b" "ま"
    ".b" "や"
    ".b" SHIFT_JIS_WAVE_DASH "　　"
    ".b" "ハイ！";

char D_0805d030[] =
    ".d" "た"
    ".b" "ま"
    ".b" "や"
    ".b" SHIFT_JIS_WAVE_DASH "　　"
    ".b" "ハイ！";

char D_0805d050[] =
    ".d" "た"
    ".d" "ま"
    ".b" "や"
    ".b" SHIFT_JIS_WAVE_DASH "　　"
    ".b" "ハイ！";

char D_0805d070[] =
    ".d" "た"
    ".d" "ま"
    ".d" "や"
    ".b" SHIFT_JIS_WAVE_DASH "　　"
    ".b" "ハイ！";

char D_0805d090[] =
    ".d" "た"
    ".d" "ま"
    ".d" "や"
    ".d" SHIFT_JIS_WAVE_DASH "　　"
    ".b" "ハイ！";

char D_0805d0b0[] =
    "　"
    ".c" "た"
    ".c" "ま"
    ".c" "や"
    ".c" SHIFT_JIS_WAVE_DASH "　"
    ".c:0" "ハイ！";

char D_0805d0d0[] = "さあ、　ではホンバン！";

char D_0805d0e8[] = "あいずは　ナシだぜ・・・";
