#include "global.h"
#include "text.h"


/* Game Text - Rhythm Test */


char D_0805eed8[] = "音に合わせて、Ａボタンを押してください";

char D_0805ef00[] = "あと半分";

char D_0805ef0c[] = "3";

char D_0805ef10[] = "2";

char D_0805ef14[] = "1";

char D_0805ef18[] = "「ゼロ」と同時に、Ａボタンを押してください";

char D_0805ef44[] = "音が消えるところは、心でカウントしてください";

char D_0805ef74[] = "では、測定をはじめます";

char D_0805ef8c[] = "音に合わせて、Ａボタンを押してください";

char D_0805efb4[] = "そのまま、キープしつづけて下さい";

char D_0805efd8[] = "だいぶ、努力が必要かも…";

char D_0805eff4[] = "もう少し、がんばりましょう。";

char D_0805f014[] = "人並みの正確さをお持ちです。";

char D_0805f034[] = "正確な体内時計をお持ちです！";

char D_0805f054[] = "すごい！　電波時計なみの正確さ！！";

char D_0805f078[] = "あなたのリズム感をしらべましょう";

char D_0805f09c[] = "これから、３回のテストをします";

char D_0805f0bc[] = "では、１回目です";

char D_0805f0d0[] = "２回目のテスト、いきます";

char D_0805f0ec[] = "さいごのテストです";

char D_0805f100[] = "さて、結果は…？";
