#include "global.h"
#include "text.h"


/* Game Text - Karate Man */


char D_0805ab50[] = "きほんが　できてない。";

char D_0805ab68[] = "";

char D_0805ab6c[] = "つづけざまは　ニガテみたいだね。";

char D_0805ab90[] = "れんぞくパンチに　キレがある！";

char D_0805abb0[] = "さいご キマってた！";

char D_0805abc4[] =
    "\n"
    "ノるのを　忘れずにネ！";

char D_0805abdc[] = "師匠のおことば";

char D_0805abec[] =
    "ようこそ！\n"
    "カラテ家のゲームへ。";

char D_0805ac0c[] = "このゲームは、Aボタンで「モノ」をパンチするだけだけどもタイミングが超シビアです。";

char D_0805ac60[] =
    "まずは、とんでくる\n"
    "「モノ」を　ビシッ　と\n"
    "パンチしてみよう。";

char D_0805aca0[] =
    "どう？\n"
    "タイミングのシビアさ、\n"
    "わかってもらえたかな？";

char D_0805acd8[] =
    "つぎは、音楽にあわせて\n"
    "パンチしてみよう！";

char D_0805ad04[] =
    "どうですか？\n"
    "音楽にノると、やりやすくないですか？";

char D_0805ad38[] =
    "では、そんなカンジで\n"
    "音楽にノッて「モノ」を\n"
    "ビシビシ　たたきましょう！";

char D_0805ad80[] =
    "\n"
    "本番、スタート！！";
