#include "global.h"
#include "text.h"


/* Game Text - Spaceball */


char D_0805bdc8[] = "きほんが　できてません。";

char D_0805bde4[] = "";

char D_0805bde8[] = "タメが　かっこわるい。";

char D_0805be00[] = "タメが　しっかりしている！";

char D_0805be1c[] = "画面を頼りすぎです。";

char D_0805be34[] = "見えなくて　できている！";

char D_0805be50[] = "スピードに　やられてます。";

char D_0805be6c[] = "速いのがカンペキ！";

char D_0805be80[] = "きほんが　できてません。";

char D_0805be9c[] = "";

char D_0805bea0[] = "タメが　かっこわるい。";

char D_0805beb8[] = "タメが　しっかりしている！";

char D_0805bed4[] = "画面を頼りすぎです。";

char D_0805beec[] = "見えなくて　できている！";

char D_0805bf08[] = "スピードに　やられてます。";

char D_0805bf24[] = "速いのがカンペキ！";

char D_0805bf38[] = "きほんが　できてません。";

char D_0805bf54[] = "";

char D_0805bf58[] = "タメが　かっこわるい。";

char D_0805bf70[] = "タメが　しっかりしている！";

char D_0805bf8c[] = "見た目に　たよりすぎです。";

char D_0805bfa8[] = "見えなくても　できている！";

char D_0805bfc4[] = "スピードに　やられてます。";

char D_0805bfe0[] = "速いのが　カンペキ！";

char D_0805bff8[] = "つうしんぼ";

char D_0805c004[] = "きほんが　できてません。";

char D_0805c020[] = "";

char D_0805c024[] = "タメが　かっこわるい。";

char D_0805c03c[] = "タメが　しっかりしている！";

char D_0805c058[] = "見た目に　たよりすぎです。";

char D_0805c074[] = "見えなくても　できている！";

char D_0805c090[] = "スピードに　やられてます。";

char D_0805c0ac[] = "速いのが　カンペキ！";

char D_0805c0c4[] = "つうしんぼ";
