#include "global.h"
#include "text.h"


/* Game Text - Showtime */


char D_0805e180[] = "ペンギン、不満足。";

char D_0805e194[] = "ペンギンも満足。";

char D_0805e1a8[] = "ペンギンのようす";

char D_0805e1bc[] = "ほんばん　スタート！";

char D_0805e1d4[] = "ペンギンと　ショーを　やります。";

char D_0805e1f8[] = "あいずに　あわせて　Ａボタン！";

char D_0805e218[] = "";

char D_0805e21c[] = "１";

char D_0805e220[] = "２";

char D_0805e224[] = "ハイ！";

char D_0805e22c[] = "そんなかんじ";

char D_0805e23c[] = "つぎは　でっかいペンギン";

char D_0805e258[] = "イイカンジです";

char D_0805e268[] = "つぎは　しろいペンギン";

char D_0805e280[] = "はやいヨ！";

char D_0805e28c[] = "そろそろ　はじまりまーす！！";
