#include "global.h"
#include "text.h"


/* Game Text - Rat Race */


char D_0805d104[] = "キレが　ないよ。";

char D_0805d118[] = "きっちり　とまってる！";

char D_0805d130[] = "でだしが　ぐだぐだ・・・";

char D_0805d14c[] = "でだしが　バッチリ！";

char D_0805d164[] = "もう！　ジャマしないでよ！";

char D_0805d180[] = "";

char D_0805d184[] = "あいずを　したら";

char D_0805d198[] = "Ａを　おしつづけて";

char D_0805d1ac[] = "ストップしろ！";

char D_0805d1bc[] = "つぎの　あいずで";

char D_0805d1d0[] = "Ａを　はなして";

char D_0805d1e0[] = "はしりだせ！";

char D_0805d1f0[] = "んじゃ　いくぞ！";

char D_0805d204[] = "もう　あいずは";

char D_0805d214[] = "しないから";

char D_0805d220[] = "しっかりやれよ！";

char D_0805d234[] = "なかまから　ひとこと";
