#include "global.h"
#include "text.h"


/* Game Text - Horse Machine */


char D_0805c3d4[] = "レッスン１が　イマイチ。";

char D_0805c3f0[] = "レッスン１は　バッチリ！";

char D_0805c40c[] = "レッスン２が　イマイチ。";

char D_0805c428[] = "レッスン２は　バッチリ！";

char D_0805c444[] = "レッスン３が　イマイチ。";

char D_0805c460[] = "レッスン３は　バッチリ！";

char D_0805c47c[] = "レッスン４が　イマイチ。";

char D_0805c498[] = "レッスン４は　バッチリ！";

char D_0805c4b4[] = "あしおとに　あわせて";

char D_0805c4cc[] = "すきなボタンを　おしてね。";

char D_0805c4e8[] = "レッスン１　「ナミアシ」";

char D_0805c504[] = "";

char D_0805c508[] = "ＯＫ！　つぎいきます。";

char D_0805c520[] = "レッスン２　「ハヤアシ」";

char D_0805c53c[] = "レッスン３　「カケアシ」";

char D_0805c558[] = "ＯＫ！　さいごです。";

char D_0805c570[] = "レッスン４　「シュウホ」";

char D_0805c58c[] = "ＯＫ！　おつかれさま！";

char D_0805c5a4[] = "レッスン１が　イマイチ。";

char D_0805c5c0[] = "レッスン１は　バッチリ！";

char D_0805c5dc[] = "レッスン２が　イマイチ。";

char D_0805c5f8[] = "レッスン２は　バッチリ！";

char D_0805c614[] = "レッスン３が　イマイチ。";

char D_0805c630[] = "レッスン３は　バッチリ！";

char D_0805c64c[] = "レッスン４が　イマイチ。";

char D_0805c668[] = "レッスン４は　バッチリ！";

char D_0805c684[] = "あしおとに　あわせて";

char D_0805c69c[] = "すきなボタンを　おしてね。";

char D_0805c6b8[] = "レッスン１　「ナミアシ」";

char D_0805c6d4[] = "";

char D_0805c6d8[] = "ＯＫ！　つぎいきます。";

char D_0805c6f0[] = "レッスン２　「ハヤアシ」";

char D_0805c70c[] = "レッスン３　「カケアシ」";

char D_0805c728[] = "ＯＫ！　さいごです。";

char D_0805c740[] = "レッスン４　「シュウホ」";

char D_0805c75c[] = "ＯＫ！　おつかれさま！";
