#include "global.h"
#include "text.h"


/* Game Text - Rhythm Tweezers */


char D_0805b490[] = "しっかり　ぬいてください。";

char D_0805b4ac[] = "";

char D_0805b4b0[] = "ながい毛が　処理できてません。";

char D_0805b4d0[] = "ながい毛が　すっきりです！";

char D_0805b4ec[] = "多いところが　ぬきのこしすぎです。";

char D_0805b510[] = "多かったところ、ツルツルです！";

char D_0805b530[] = "ムダ毛　チェック";

char D_0805b544[] = "ようこそ。";

char D_0805b550[] = "Ａボタン、または" SHIFT_JIS_KANJI_JUU "字ボタンで　毛をぬいてネ！";

char D_0805b580[] = "\x05\x30" "\x01\x34" "\x03\x31" "\x01\x6d" "ＯＫ";

char D_0805b590[] = "\x05\x34" "\x01\x38" "\x03\x30" "\x01\x73" "まきヒゲは　ボタンを長く押して引っぱってネ。";

char D_0805b5c8[] = "\x05\x34" "\x01\x38" "\x03\x30" "\x01\x73" "多いときは、両手でするとラクだヨ。";

char D_0805b5f4[] = "\x05\x34" "\x01\x38" "\x03\x30" "\x01\x73" "では、ほんばんです。";

char D_0805b614[] = "しっかり　ぬいてください。";

char D_0805b630[] = "";

char D_0805b634[] = "ながい毛が　処理できてません。";

char D_0805b654[] = "ながい毛が　すっきりです！";

char D_0805b670[] = "多いところが　ぬきのこしすぎです。";

char D_0805b694[] = "多かったところ、　ツルツルです！";

char D_0805b6b8[] = "超すばやい　ぬきっぷりです！　エライ！！";

char D_0805b6e4[] = "ムダ毛　チェック";
