#include "global.h"
#include "text.h"


/* Game Text - The Bon Odori */


char D_080676b4[] = "前半が　いまひとつだったなぁ。";

char D_080676d4[] = "前半、ばっちりだね！";

char D_080676ec[] = "後半、もりさがっちゃってたなぁ。";

char D_08067710[] = "後半で　もりあがったね" SHIFT_JIS_WAVE_DASH "！";

char D_0806772c[] = "";

char D_08067730[] = "クライマックスが　きまってた！！";

char D_08067754[] = "さいごに　ちゃんと　シメてたね！";

char D_08067778[] = "まわりの評判";

char D_08067788[] = ".0:0" "ハァ" SHIFT_JIS_WAVE_DASH;

char D_08067794[] = ".0:0" "はなび　あがれば" SHIFT_JIS_WAVE_DASH;

char D_080677ac[] = ".1:0" "ど" ":1" "ーん　" ".1:0" "ど" ":1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん";

char D_080677e8[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ん";

char D_08067814[] = ".0:0" "ハァ" SHIFT_JIS_WAVE_DASH "　ア" SHIFT_JIS_WAVE_DASH;

char D_08067828[] = ".0:0" "かんせい　あがる" SHIFT_JIS_WAVE_DASH;

char D_08067840[] = ".0:0" "にんき　あがれば" SHIFT_JIS_WAVE_DASH;

char D_08067858[] = ".0:0" "きゅうりょう　あがる" SHIFT_JIS_WAVE_DASH;

char D_08067874[] = ".0:0" "まつりだ　わっしょい！";

char D_08067890[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ　" ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ";

char D_080678d4[] = ".0:0" "にっぽんじゅうが　わっしょい！";

char D_080678f8[] = ".1:0" "ど" ":1" "ーん　" ".1:0" "ど" ":1" "ーん　" ".2:0" "ぱ" ".2:1" "ん";

char D_08067924[] = ".0:0" SHIFT_JIS_KATAKANA_SO "レ　ひっくり　かえって";

char D_08067944[] = ".0:0" "ハァ" SHIFT_JIS_WAVE_DASH "　ぼんおどり";

char D_0806795c[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ";

char D_08067980[] = ".1:0" "ど" ":1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ん";

char D_080679ac[] = ".0:0" "アメが　あがれば" SHIFT_JIS_WAVE_DASH;

char D_080679c4[] = ".0:0" "やぐらに　あがる" SHIFT_JIS_WAVE_DASH;

char D_080679dc[] = ".0:0" "ほら！　まつりだ　わっしょい！";

char D_08067a00[] = ".0:0" "これぞ";

char D_08067a0c[] = ".0:0" "メイド　イン　ジャ" ".2" "パ" ":1" "ン";

char D_08067a2c[] = ".2:0" "ぱ" ".2:1" "ん　" ".2:0" "ぱ" ".2:1" "ん";

char D_08067a48[] = ".1:0" "ど" ":1" "ーん　" ".1:0" "ど" ":1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ん";

char D_08067a84[] = ".6:1" "ぼんおどり　しましょう！";

char D_08067aa4[] = ".6:1" "みんなの　てびょうしを　まねしてネ。";

char D_08067ad0[] = ".6:0" "ＯＫ！";

char D_08067adc[] = ".6:1" "も" SHIFT_JIS_WAVE_DASH "いっちょ　いってみよう！";

char D_08067b00[] = ".6:1" "では、　ほんばん　がんばってネ！";

