#include "global.h"
#include "text.h"


/* Game Text - Bon Dance */


const char D_0806a384[] = "前半が　いまひとつだったなぁ。";

const char D_0806a3a4[] = "前半、ばっちりだね！";

const char D_0806a3bc[] = "後半、もりさがっちゃってたなぁ。";

const char D_0806a3e0[] = "後半で　もりあがったね～！";

const char D_0806a3fc[] = "";

const char D_0806a400[] = "クライマックスが　きまってた！！";

const char D_0806a424[] = "さいごに　ちゃんと　シメてたね！";

const char D_0806a448[] = "まわりの評判";

const char D_0806a458[] = ".0:0" "ハァ～";

const char D_0806a464[] = ".0:0" "はなび　あがれば～";

const char D_0806a47c[] = ".1:0" "ど" ":1" "ーん　" ".1:0" "ど" ":1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん";

const char D_0806a4b8[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ん";

const char D_0806a4e4[] = ".0:0" "ハァ～　ア～";

const char D_0806a4f8[] = ".0:0" "かんせい　あがる～";

const char D_0806a510[] = ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん　" ".1:0" "ど" ":1" "んど　" ".1:0" "ど" ":1" "ーん";

const char D_0806a54c[] = ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ　" ".1:0" "ど" ":1" "ーん　" ".2:0" "ぱ" ".2:1" "ん";

const char D_0806a57c[] = ".0:0" "にんき　あがれば～";

const char D_0806a594[] = ".0:0" "きゅうりょう　あがる～";

const char D_0806a5b0[] = ".0:0" "まつりだ　わっしょい！";

const char D_0806a5cc[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ　" ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ";

const char D_0806a610[] = ".0:0" "にっぽんじゅうが　わっしょい！";

const char D_0806a634[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ　" ".2:0" "ぱ" ".2:1" "ん";

const char D_0806a664[] = ".0:0" "ソ\レ　ひっくり　かえって";

const char D_0806a684[] = ".0:0" "ハァ～　ぼんおどり";

const char D_0806a69c[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ";

const char D_0806a6c0[] = ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ　" ".1:0" "ど" ":1" "んど";

const char D_0806a6e4[] = ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ　" ".2:0" "ぱ" ".2:1" "ん";

const char D_0806a718[] = ".0:0" "アメが　あがれば～";

const char D_0806a730[] = ".0:0" "やぐらに　あがる～";

const char D_0806a748[] = ".0:0" "ほら！　まつりだ　わっしょい！";

const char D_0806a76c[] = ".0:0" "これぞ";

const char D_0806a778[] = ".0:0" "メイド　イン　ジャ" ".2" "パ" ":1" "ン";

const char D_0806a798[] = ".2:0" "ぱ" ".2:1" "ん";
