#include "global.h"
#include "text.h"


/* Game Text - Ninja Bodyguard */


char D_0805b8e0[] = "ちゃんと　守ってよネ…";

char D_0805b8f8[] = "";

char D_0805b8fc[] = "すばやい　剣さばきが　みじゅくである。";

char D_0805b924[] = "すばやい　剣さばきであった！";

char D_0805b944[] = "「四連矢」　に　コテンパンである。";

char D_0805b968[] = "「四連矢返し」　が　おみごと！";

char D_0805b988[] = "トノから　ひとこと";

char D_0805b99c[] = "ちゃんと　守ってよネ…";

char D_0805b9b4[] = "";

char D_0805b9b8[] = "すばやい　棒さばきが　みじゅくね。";

char D_0805b9dc[] = "すばやい　棒さばきだったわ！";

char D_0805b9fc[] = "「五連石」　に　コテンパンね。";

char D_0805ba1c[] = "「五連石返し」　が　おみごとよ！";

char D_0805ba40[] = "すごい！　いっしゅんで２コの石を！！";

char D_0805ba68[] = "カノジョの　ひとこと";
