#include "global.h"
#include "text.h"


/* Game Text - Remix 2 */


char D_08067ecc[] = "まだまだです。";

char D_08067edc[] = "かなり、　サイコーでーす！";

char D_08067ef8[] = "はんだん　りょくが　かけてます。";

char D_08067f1c[] = "すばらしい　はんだん　りょくだ！";

char D_08067f40[] = "もっと　ウデを　みがこう。";

char D_08067f5c[] = "とても　テクニカルだ！";

char D_08067f74[] = "なぞのリズム組織から通達";

char D_08067f90[] = ".1:0ど:1ーん　.1:0ど:1ーん　.2:0ぱ.2:1ーん　.2:0ぱ.2:1ん";

char D_08067fcc[] = ".1:0ど:1んど　.2:0ぱ.2:1ーん　.2:0ぱ.2:1ん";

char D_08067ff8[] = "こい　してる？";

char D_08068008[] = "アセるー！！";

char D_08068018[] = "がんばって" SHIFT_JIS_WAVE_DASH "！";

char D_08068028[] = "";
