#include "global.h"
#include "text.h"


/* Game Text - Remix 6 */


char D_0806a7a8[] = "まだまだです。";

char D_0806a7b8[] = "かなり、　サイコーでーす！";

char D_0806a7d4[] = "はんだん　りょくが　かけてます。";

char D_0806a7f8[] = "すばらしい　はんだん　りょくだ！";

char D_0806a81c[] = "もっと　ウデを　みがこう。";

char D_0806a838[] = "とても　テクニカルだ！";

char D_0806a850[] = "なぞのリズム組織から通達";

char D_0806a86c[] = "それでは　ここで　おさらいを　はじめる！";

char D_0806a898[] = "さきに　いっとくが、　わりと　カンタンだ！！";

char D_0806a8c8[] = "たのしんでネ！";

char D_0806a8d8[] =
    "\n"
    "いきます！";

char D_0806a8e4[] =
    "\n"
    "どうぞ。";

char D_0806a8f0[] =
    "\n"
    "そこまで！！";

char D_0806a900[] =
    "\n"
    "ザンネン！！";

char D_0806a910[] =
    "\n"
    "おみごと！！";

char D_0806a920[] = ".1:0" "ど" ":1" "んど　" ".2:0" "ぱ" ".2:1" "ん" ".2:0" "ぱ";

char D_0806a944[] = ".1:0" "ど" ":1" "ーん　" ".2:0" "ぱ" ".2:1" "ーん　" ".2:0" "ぱ" ".2:1" "ん";

char D_0806a970[] = "おわり！";
