#include "global.h"
#include "text.h"


/* Game Text - Sneaky Spirits */


char D_0805ba80[] = "きほんが　できてませんね。";

char D_0805ba9c[] = "";

char D_0805baa0[] = "音が消えると　あせるみたい．．．";

char D_0805bac4[] = "音が消えても　おちついている！";

char D_0805bae4[] = "ちゃんと　カウント　しようね。";

char D_0805bb04[] = "体内カウント　バッチシだ！";

char D_0805bb20[] = "超ゆっくりでも　すばらしい！";

char D_0805bb40[] = "その　しろいヤツを、";

char D_0805bb58[] = "やっつけよう！";

char D_0805bb68[] = "タイミングは…";

char D_0805bb78[] = "　　　ココ！";

char D_0805bb88[] = "よく　みててネ！";

char D_0805bb9c[] = "いくよ…";

char D_0805bba8[] = "では　ほんばん　スタートです";

char D_0805bbc8[] = "雨のささやき";

char D_0805bbd8[] = "きほんが　できてませんね。";

char D_0805bbf4[] = "";

char D_0805bbf8[] = "音が消えると　あせるみたい．．．";

char D_0805bc1c[] = "音が消えても　おちついている！";

char D_0805bc3c[] = "ちゃんと　カウント　しようね。";

char D_0805bc5c[] = "体内カウント　バッチシだ！";

char D_0805bc78[] = "超ゆっくりでも　すばらしい！";

char D_0805bc98[] = "雨のささやき";
