#include "global.h"
#include "graphics.h"
#include "text.h"
#include "src/scenes/cafe.h"
#include "graphics/cafe/cafe_graphics.h"


  /* CAFE - DIALOGUE */


// [D_089cd2e8] Dialogue - First Visit
    /* -------------------------------- */
        //
        // Welcome. This is your
        // first time here, isn't it?
        //
    /* -------------------------------- */
        // This is the Cafe.
        // <When you can't finish a game>,
        // or when you just want a break,
        // please come here and relax.
    /* -------------------------------- */
        //
        // I'm pretty good at Rhythm Games.
        // If you need help, <come to the Cafe>.
        //
    /* -------------------------------- */
        //
        // I'm still unpacking boxes, so
        // please come back in a bit.
        //
    /* -------------------------------- */
        //
        //
        // See you later.
        //
    /* -------------------------------- */

const char *cafe_dialogue_first_visit[] = {
    /* ------------------------------------------------ */
        "\n"
        "いらっしゃいませ。\n"
        "こちらに　来たのは　はじめてですね？\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "ここは　いわゆる　キッサ店です。\n"
        "ゲームが　" "\0051" "\0015" "うまくできないとき" "\0054" "\0018" "や\n"
        "つかれたときにでも　おいで下さい。",
    /* ------------------------------------------------ */
        "\n"
        "わたしに　できることが　あれば、\n"
        "\0051" "\0015" "ちからに　なりますよ" "\0054" "\0018" "。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "いま　ちょっと　しこみ中なので\n"
        "また　あとで　きてくださいね。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "\n"
        "では　また。\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd300] Dialogue - Come Back Later
    /* -------------------------------- */
        //
        //
        // Come back in a while!
        //
    /* -------------------------------- */

const char *cafe_dialogue_come_back_later[] = {
    /* ------------------------------------------------ */
        "\n"
        "\n"
        "しばらく　してから　きてね～。\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd308] Dialogue - Keep Trying
    /* -------------------------------- */
        //
        // You know, after a few tries
        // I think you'll manage that superb.
        //
    /* -------------------------------- */
        //
        // Just keep moving to the music,
        // and you'll have fun doing it, too.
        //
    /* -------------------------------- */
        //
        // Don't let it frustrate you.
        // You're supposed to enjoy yourself.
        //
    /* -------------------------------- */

const char *cafe_dialogue_keep_trying[] = {
    /* ------------------------------------------------ */
        "\n"
        "なんどか　やるうちに　コツが\n"
        "つかめると　思いますよ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "それと同時に　音楽に　ノるのが\n"
        "楽しくなるとも思うんです。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "あまり　ムキに　ならずに\n"
        "楽しんで下さいね…\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd318] Dialogue - Practicing for the Perfect Campaign
    /* -------------------------------- */
        //
        // Sorry for yelling. I just got
        // a little too excited there.
        //
    /* -------------------------------- */
        //
        // Please try your best
        // for those Perfects.
        // See you soon!
    /* -------------------------------- */

const char *cafe_dialogue_practicing_perfect[] = {
    /* ------------------------------------------------ */
        "\n"
        "大きい声をだして　すみません。\n"
        "なんだか　うれしかったものですから…\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "パーフェクト　がんばってくださいね。\n"
        "ではまた。\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd324] Dialogue - Not Practicing for the Perfect Campaign
    /* -------------------------------- */
        //
        // Is that right? Loose lips can sink
        // friendships... please forgive me.
        //
    /* -------------------------------- */
        //
        // Please enjoy the
        // game. See you!
        //
    /* -------------------------------- */

const char *cafe_dialogue_not_practicing_perfect[] = {
    /* ------------------------------------------------ */
        "\n"
        "そうですか。\n"
        "ウワサ話なんて　してしまい\n"
        "しつれいしました。",
    /* ------------------------------------------------ */
        "\n"
        "ゲーム　楽しんでくださいね。\n"
        "ではまた。\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd330] Dialogue - All Perfects Cleared
    /* -------------------------------- */
        //
        // You must have excellent rhythm
        // sense to have gotten this far!
        //
    /* -------------------------------- */
        //
        // Oh, I'm so happy I think
        // I might just start to cry.
        //
    /* -------------------------------- */
        //
        // Well, in celebration I've added
        // more songs to the studio.
        //
    /* -------------------------------- */
        //
        // Wow. It looks like you've
        // mastered the game. Not bad.
        //
    /* -------------------------------- */
        //
        // Had enough, I suppose? Go
        // get some rest. I'll be waiting.
        //
    /* -------------------------------- */

const char *cafe_dialogue_all_perfects_clear[] = {
    /* ------------------------------------------------ */
        "\n"
        "もう、そこまで　やりこんだら\n"
        "リズム感　かなり　良くなって\n"
        "いるでしょうネ！",
    /* ------------------------------------------------ */
        "\n"
        "なんだか　私も、すっごく\n"
        "うれしくって　ウルウルです…\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "そうそう、\n"
        "お祝いに　ささやかでは　ありますが\n"
        "スタジオの曲をふやしておきました。\n",
    /* ------------------------------------------------ */
        "\n"
        "いやいや、しかし　なんと　まぁ\n"
        "コンプリートですか。\n"
        "やりますな～。",
    /* ------------------------------------------------ */
        "\n"
        "おつかれでしょう？\n"
        "少し　休んでくださいネ。\n"
        "では　また。",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd348] Praise
    /* -------------------------------- */
        //
        //
        // Not too bad!!
    /* -------------------------------- */
        //
        //
        // You're good!!
    /* -------------------------------- */
        //
        //
        // Congratulations!!
    /* -------------------------------- */
        //
        //
        // Good job!!
    /* -------------------------------- */
        //
        //
        // Unbelievable!!
    /* -------------------------------- */

const char *cafe_dialogue_shouts_praise[] = {
    /* ------------------------------------------------ */
    "\0032" "\001l" "\0051" "\0015" "\n"
    "\n"
    "すごいじゃなーい!!" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
    "\0032" "\001l" "\0051" "\0015" "\n"
    "\n"
    "やるじゃなーい!!" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
    "\0032" "\001l" "\0051" "\0015" "\n"
    "\n"
    "おめでとー!!" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
    "\0032" "\001l" "\0051" "\0015" "\n"
    "\n"
    "グッド　ジョブ!!" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
    "\0032" "\001l" "\0051" "\0015" "\n"
    "\n"
    "アンビリーバボー!!" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
};


// [D_089cd35c] Encouragement
    /* -------------------------------- */
        //
        //
        // <Go for it!>
    /* -------------------------------- */
        //
        //
        // <Fight!>
    /* -------------------------------- */
        //
        //
        // <Go! Go!>
    /* -------------------------------- */
        //
        //
        // Good luck!
    /* -------------------------------- */
        //
        //
        // I was moved!
    /* -------------------------------- */

const char *cafe_dialogue_shouts_cheer[] = {
    /* ------------------------------------------------ */
        "\0032" "\001l" "\0051" "\0015" "\n"
        "\n"
        "がんばれー！" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
        "\0032" "\001l" "\0051" "\0015" "\n"
        "\n"
        "ファイトー！" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
        "\0032" "\001l" "\0051" "\0015" "\n"
        "\n"
        "イケイケー！" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
        "\0032" "\001l" "\0051" "\0015" "\n"
        "\n"
        "グッド　ラック！" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
        "\0032" "\001l" "\0051" "\0015" "\n"
        "\n"
        "感動したー！" "\0030" "\001s" "\0054" "\0018",
    /* ------------------------------------------------ */
};


// [D_089cd370] Dialogue - Rhythm Sense
    /* -------------------------------- */
        //
        // By the way, I wonder how
        // Rhythm Sense is for humans?
        //
    /* -------------------------------- */
        //
        // Well, not that I'm very
        // aware of it myself.
        //
    /* -------------------------------- */
        //
        // But you'll be a bit happier once you
        // find your Rhythm Sense, I'm sure.
        //
    /* -------------------------------- */
        //
        // Maybe I should try a little harder
        // to get good at Rhythm Heaven...
        //
    /* -------------------------------- */

const char *cafe_dialogue_rhythm_sense[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、リズム感って　人間にとって　どういうものなんでしょうねぇ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "ま、私なんかは　あんまり\n"
        "いしきすることも　ないんですがね。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "でも、リズム感が　よくなると　きっと　ちょっと　ハッピーに　なるんでしょうね。",
    /* ------------------------------------------------ */
        "\n"
        "\n"
        "私も　ゲーム　してみようかな…\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd384] Dialogue - Offbeats
    /* -------------------------------- */
        //
        // I hear the word "offbeat" often.
        // Do you know what an "offbeat" is?
        //
    /* -------------------------------- */
        // Honestly, I wasn't sure
        // what it meant either.
        // So, the other day I looked
        // up the definition.
    /* -------------------------------- */
        //
        // How do I explain it...
        // Well, you naturally clap
        // your hands to music, right?
    /* -------------------------------- */
        // Halfway between one clap
        // and the next (the "onbeats")
        // is called the "offbeat".
        // At least, so I understand.
    /* -------------------------------- */
        // Did you know that already?
        // Sorry if it seems like I'm
        // talking down to you.
        // Anyways, see you again.
    /* -------------------------------- */

const char *cafe_dialogue_offbeats[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、この世界でよく聞く\n"
        "「ウラ」って　どういうものか\n"
        "知ってますか？",
    /* ------------------------------------------------ */
        "\n"
        "ま、私も　それほど　詳しくはないので　アレなんですけどネ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "たとえば、音楽にあわせて\n"
        "自然に手をたたくとしますね。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "その　手びょうしと手びょうしの\n"
        "ちょうど　まん中のタイミングが\n"
        "「ウラ」なんだそうです。",
    /* ------------------------------------------------ */
        "\n"
        "まぁ、そういうモン　らしいです。\n"
        "テキトーで　ごめんなさいネ。\n"
        "では　また。",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd39c] Dialogue - Rhythm Test
    /* -------------------------------- */
        //
        // Say, when was the last time you
        // checked your "Rhythm Test" score?
        //
    /* -------------------------------- */
        //
        // I just tried it again yesterday, but
        // 65 points seems to be my limit...
        //
    /* -------------------------------- */
        //
        // I always have trouble with
        // the rests in the second test.
        //
    /* -------------------------------- */
        //
        // Counting to yourself is hard, isn't it?
        // I always go too fast or lose my place.
        //
    /* -------------------------------- */
        //
        // Well, nothing we can do but practice.
        // Take care for now.
        //
    /* -------------------------------- */

const char *cafe_dialogue_rhythm_test[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、\n"
        "最近　「リズム感測定」してます？\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "私も　ときどき　やるんですけど\n"
        "６５点くらいが　限界なんですよねぇ…\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "なかなか　どうして　２つめのテストが　うまく　できないんですヨ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "空白を　カウントするってのは\n"
        "ムズいもんですね～。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "ま、ぼちぼち　やっていきましょうネ。\n"
        "では　また。\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd3b4] Dialogue - Drum Lessons
    /* -------------------------------- */
        //
        // Let me ask... have you tried the
        // Drum Lessons in the Prize Corner?
        //
    /* -------------------------------- */
        //
        // I take lessons once a week, but
        // I don't really seem to improve.
        //
    /* -------------------------------- */
        // The teacher is really strict.
        // I asked him for an easier
        // lesson, but he told me to
        // just keep on trying my best.
    /* -------------------------------- */
        //
        // You'll find it's hard to quit
        // once you start a lesson.
        //
    /* -------------------------------- */
        // Maybe it's for the best.
        // For musical instruments, you
        // just have to keep at it.
        // You should try your best, too.
    /* -------------------------------- */

const char *cafe_dialogue_drum_lessons[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、おまけコーナーの　ドラムレッスンって　やったことあります？\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "私は　週に１回だけ　レッスンを\n"
        "うけてるんですが、なかなか\n"
        "上達しませんねぇ。",
    /* ------------------------------------------------ */
        "\n"
        "先生が、こういうのは　すききらいが\n"
        "あるから、ムリして　しないでネって\n"
        "言ってましたけど、",
    /* ------------------------------------------------ */
        "\n"
        "レッスンを　やりだすと　これが\n"
        "なかなか　やめられないんですよね～。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "ま、楽器は　すぐには　うまくならないでしょうし、じっくりと　つきあってみましょうかね…",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd3cc] Dialogue - Staying Up All Night
    /* -------------------------------- */
        //
        // By the way, right now
        // I'm terribly tired...
        //
    /* -------------------------------- */
        //
        // I was up all last night playing.
        // I just couldn't stop myself...
        //
    /* -------------------------------- */
        //
        // What? Oh, I was talking to myself.
        // It was a monologue... sorry.
        //
    /* -------------------------------- */
        //
        // Learn from me, and don't forget
        // to take a break every so often.
        // Anyway, see you again.
    /* -------------------------------- */

const char *cafe_dialogue_adhd[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、\n"
        "なんだか　今　すごく　ねむいのです…\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "\n"
        "きのう　おそくまで　遊んでたからなぁ…\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "あ、いや、こっちの話です。\n"
        "ひとりごとですので…　すみませんね。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "こんど　ドライブでも　行きませんか？\n"
        "ま、よかったら　ですけどネ。\n"
        "では　また。",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd3e0] Dialogue - Coffee
    /* -------------------------------- */
        //
        // By the way, here's the
        // coffee you ordered.
        //
    /* -------------------------------- */
        //
        // Hm? You didn't order it?
        // Ah, I see. This is actually
        // for the guy next to you...
    /* -------------------------------- */
        //
        // Well... he isn't a talkative person,
        // but you seem to be getting along.
        //
    /* -------------------------------- */
        //
        // All I can do is pour
        // the coffee, but... heh.
        //
    /* -------------------------------- */

const char *cafe_dialogue_coffee[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、\n"
        "コーヒー　入りましたヨ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "え？　たのんでないって？　あぁ、これは　おとなりから　なんですが…\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "ま、まぁ　無口な方ですが\n"
        "なかよくしたいんじゃないですか？\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "私は、コーヒーを　入れるだけしか\n"
        "できませんが…　ははは…\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd3f4] Dialogue - Dog
    /* -------------------------------- */
        //
        // By the way, if you hadn't
        // noticed, I'm actually a dog.
        //
    /* -------------------------------- */
        //
        // I'm not one of those young pups,
        // either. I'm nine years old.
        //
    /* -------------------------------- */
        //
        // When you get to be my age,
        // time really does seem to fly.
        //
    /* -------------------------------- */
        //
        // Hey, you're a human, right?
        // Well, despite our species I still
        // hope that we can get along
    /* -------------------------------- */

const char *cafe_dialogue_dog_barista[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、\n"
        "実は　私　犬なんですヨ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "かれこれ　９才で　もう　けっこう\n"
        "いいトシなんです。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "いやはや、このトシになると\n"
        "時がたつのが　はやいですねぇ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "お客さんは　人間ですよね？\n"
        "まぁ、私は　犬ですが　これからも\n"
        "なかよくしてくださいネ～。",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd408] Dialogue - Music
    /* -------------------------------- */
        //
        // By the way, what do
        // you do when you're sad?
        // I always listen to music.
    /* -------------------------------- */
        //
        // Taking out a good old record and
        // reminiscing about the past
        // always makes me feel better.
    /* -------------------------------- */
        //
        // Music is strange, isn't it?
        // It has this mysterious
        // power to heal the heart.
    /* -------------------------------- */
        //
        // Just don't think that good
        // rhythm makes you qualified
        // to be a doctor, ha ha ha.
    /* -------------------------------- */

const char *cafe_dialogue_healing_with_music[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、悲しいときって\n"
        "どうしてますか？\n"
        "私は　もっぱら　音楽を　ききますねぇ。",
    /* ------------------------------------------------ */
        "\n"
        "けっこう古いレコードなんかを　出してきて　当時を　思い出したりすると、ホッとするんです。",
    /* ------------------------------------------------ */
        "\n"
        "音楽って　フシギですよね～。\n"
        "どうして　あんなにも　心を\n"
        "ゆさぶるんでしょうね。",
    /* ------------------------------------------------ */
        "\n"
        "まぁ、私には　詳しい理屈なんて\n"
        "わからないですけどネ。ははは。\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd41c] Dialogue - Speaking Through Rhythm
    /* -------------------------------- */
        //
        // Say... did you know that you can
        // have a conversation with rhythm?
        //
    /* -------------------------------- */
        //
        // By attaching words and meanings
        // to certain beats, you can have a
        // conversation without speaking.
    /* -------------------------------- */
        // For example... you could play
        // a drum beat to ask "How are
        // you?" or say "Please come
        // visit!" even from far away.
    /* -------------------------------- */
        //
        // I learned it from another
        // customer, and now I want
        // to try it for myself.
    /* -------------------------------- */
        // Then again, if we gave speeches
        // with bongos or the neighbors
        // argued with trumpets, it'd get
        // noisy, don't you think? Ha ha ha.
    /* -------------------------------- */

const char *cafe_dialogue_speaking_with_music[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、リズムで\n"
        "会話ができるって　知ってました？\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "リズムパターンに　言葉や　意味を　対応させて、会話をするんだそうです。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "タイコの大きな音で　リズムをきざんで\n"
        "はなれた人と　コミュニケーションを\n"
        "とるらしいんですヨ。",
    /* ------------------------------------------------ */
        "\n"
        "このまえ　いらっしゃった　お客さんが\n"
        "教えてくれたんですけど、ちょっと\n"
        "面白そうじゃないですか？",
    /* ------------------------------------------------ */
        "\n"
        "でも　もし、ドラムで　選挙演説とか\n"
        "ボンゴで　夫婦ゲンカとかあったら\n"
        "やかましそうですネ。ははは。",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd434] Dialogue - Ranks and Medals
    /* -------------------------------- */
        //
        // By the way, have you ever
        // gotten a "Superb" rating on a game?
        //
    /* -------------------------------- */
        //
        // There are three grades, you know:
        // "Try Again", "OK" and "Superb".
        //
    /* -------------------------------- */
        //
        // If you get a "Superb",
        // you'll even get a medal.
        //
    /* -------------------------------- */
        // Collecting lots of medals will
        // unlock all sorts of prizes that
        // you can play with. Please do your
        // best to collect them all!
    /* -------------------------------- */
        //
        // Oh... but if you already knew that,
        // I'm sorry if I bored you.
        // See you later.
    /* -------------------------------- */

const char *cafe_dialogue_ranks_and_medals[] = {
    /* ------------------------------------------------ */
        "\n"
        "それはそうと、ゲームで\n"
        "「ハイレベル」っていう成績を\n"
        "とったことありますか？",
    /* ------------------------------------------------ */
        "\n"
        "ゲームの成績は「やりなおし」「平凡」「ハイレベル」の３つが、あるんですヨ。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "で、「ハイレベル」をとると\n"
        "メダルが　もらえるんです。\n"
        "\n",
    /* ------------------------------------------------ */
        "\n"
        "メダルを　集めると　いろいろな\n"
        "おまけが　遊べるようになるので\n"
        "がんばって　集めてくださいネ。",
    /* ------------------------------------------------ */
        "\n"
        "ご存知でしたら　つまらない話でしたネ。\n"
        "すみません。ではまた。\n"
        "\n",
    /* ------------------------------------------------ */
    END_OF_DIALOGUE
};


// [D_089cd44c] Random Dialogue Pool
const char **cafe_random_conversation_pool[] = {
    cafe_dialogue_rhythm_sense,
    cafe_dialogue_offbeats,
    cafe_dialogue_rhythm_test,
    cafe_dialogue_drum_lessons,
    cafe_dialogue_adhd,
    cafe_dialogue_coffee,
    cafe_dialogue_dog_barista,
    cafe_dialogue_healing_with_music,
    cafe_dialogue_speaking_with_music,
    cafe_dialogue_ranks_and_medals
};
