#include "global.h"
#include "text.h"


/* Game Text - Marching Orders */


char D_0805c774[] = "きほんが　できてないな。";

char D_0805c790[] = "なかなか　よろしい！";

char D_0805c7a8[] = "判断力が欠けてるぞぅ。";

char D_0805c7c0[] = "すばらしい判断力だ！";

char D_0805c7d8[] = "もっと　ウデを　みがこう。";

char D_0805c7f4[] = "とても　テクニカルだ！";

char D_0805c80c[] = "隊長の判断";

char D_0805c818[] = "しゅつどう！！";

char D_0805c828[] = "れんしゅうを　はじめる！";

char D_0805c844[] = "では　ほんばんだ！";

char D_0805c858[] = "きほんが　できてないな。";

char D_0805c874[] = "なかなか　よろしい！";

char D_0805c88c[] = "";

char D_0805c890[] = "すばらしい判断力だ！";

char D_0805c8a8[] = "隊長の判断";

char D_0805c8b4[] = "しゅつどう！！";

char D_0805c8c4[] = "れんしゅうを　はじめる！";

char D_0805c8e0[] = "では　ほんばんだ！";

char D_0805c8f4[] = "きほんが　できてなーい！";

char D_0805c910[] = "なかなか　よろしいですヨ！";

char D_0805c92c[] = "判断力が　欠けてるぅー。";

char D_0805c948[] = "すばらしい判断力だネ" SHIFT_JIS_WAVE_DASH "！";

char D_0805c964[] = "もっと　ウデを　みがいたら" SHIFT_JIS_WAVE_DASH "？";

char D_0805c984[] = "とても　テクニカルでーす！";

char D_0805c9a0[] = "リーダーの感想";
