#include "global.h"
#include "text.h"


/* Game Text - Toss Boys */


char D_0805d618[] = "練習の成果が　でてないな。";

char D_0805d634[] = "きほんが　できている！";

char D_0805d64c[] = "あせってないか？";

char D_0805d660[] = "かなり　おちついてる！";

char D_0805d678[] = "スピードに　ついてこい。";

char D_0805d694[] = "速さをモノにしている！！";

char D_0805d6b0[] = "カントクのことば";

char D_0805d6c4[] =
    "\n"
    "いきまーす！";

char D_0805d6d4[] =
    "\n"
    "おしまい。";

char D_0805d6e0[] = "練習の成果が　でてないな。";

char D_0805d6fc[] = "きほんが　できている！";

char D_0805d714[] = "あせってないか？";

char D_0805d728[] = "かなり　おちついてる！";

char D_0805d740[] = "スピードに　ついてこい。";

char D_0805d75c[] = "速さをモノにしている！！";

char D_0805d778[] = "カントクのことば";

char D_0805d78c[] =
    "\n"
    "ほんばん、　いきまーす！";

char D_0805d7a8[] =
    "\n"
    "おしまい。";

char D_0805d7b4[] =
    "\n"
    "なかよく　れんしゅう中";

char D_0805d7cc[] =
    "ひっさつワザ　１\n"
    "\x03\x31" "\x01\x6d" "\x05\x30" "\x01\x34" "ＡＢ　トストス" "\x03\x30" "\x01\x73" "\x05\x34" "\x01\x38";

char D_0805d7fc[] =
    "\n"
    "もう　いっかい";

char D_0805d80c[] =
    "\n"
    "いいね！";

char D_0805d818[] =
    "ひっさつワザ　２\n"
    "\x03\x31" "\x01\x6d" "\x05\x30" "\x01\x34" "セルフ　ブルー" "\x03\x30" "\x01\x73" "\x05\x34" "\x01\x38";

char D_0805d848[] =
    "\n"
    "もう いっちょ\x81\x60";

char D_0805d85c[] =
    "\n"
    "そうそう！！";

char D_0805d86c[] =
    "ひっさつワザ　３\n"
    "\x03\x31" "\x01\x6d" "\x05\x30" "\x01\x34" "イエロー　クイック" "\x03\x30" "\x01\x73" "\x05\x34" "\x01\x38";

char D_0805d8a0[] =
    "\n"
    "ワンス　モア";

char D_0805d8b0[] =
    "\n"
    "オーケイ";

char D_0805d8bc[] =
    "\n"
    "だいぶ　いい感じなので、";
