#include "global.h"
#include "text.h"


/* Game Text - Night Walk */


char D_0805b158[] = "おっこちちゃったね．．．";

char D_0805b174[] = "ゴール　おめでとう！！";

char D_0805b18c[] = "ノリが　ガタガタです…";

char D_0805b1a4[] = "キープ　できてます！";

char D_0805b1bc[] = "わりと　キメを　はずしたよね。";

char D_0805b1dc[] = "キメが　バッチシだ！";

char D_0805b1f4[] = "星の声";

char D_0805b1fc[] = "\x05\x31" "\x01\x35" "音楽にノって　ジャンプしてネ！";

char D_0805b220[] = "\x05\x31" "\x01\x35" "音楽が おわる前に 星でいっぱいにしてネ！";

char D_0805b250[] = "\x05\x31" "\x01\x35" "もうすぐ　おわりだヨ！";

char D_0805b26c[] = "おっこちちゃったね．．．";

char D_0805b288[] = "ゴール　おめでとう！！";

char D_0805b2a0[] = "ノリが　ガタガタです…";

char D_0805b2b8[] = "キープ　できてます！";

char D_0805b2d0[] = "わりと　キメを　はずしたよね。";

char D_0805b2f0[] = "キメが　バッチシだ！";

char D_0805b308[] = "星の声";

char D_0805b310[] = "\x05\x31" "\x01\x35" "音楽にノって　ジャンプしてネ！";

char D_0805b334[] = "\x05\x31" "\x01\x35" "ビリビリウオに　当たらないでネ！";

char D_0805b35c[] = "\x05\x31" "\x01\x35" "音楽が おわる前に 星でいっぱいにしてネ！";

char D_0805b38c[] = "\x05\x31" "\x01\x35" "もうすぐ　おわりだヨ！";
