#include "global.h"
#include "text.h"


/* Game Text - Rap Men */


char D_0805e914[] = "「ですか？」の　ノリが　あかん。";

char D_0805e938[] = "「ですか？」の　ノリが　バッチリや！";

char D_0805e960[] = "「かもネ」の　ノリが　キビシーッス。";

char D_0805e988[] = "「かもネ」の　ノリに　シビれたで！";

char D_0805e9ac[] = "「サイコー！」の　ノリが　サイコーちゃう。";

char D_0805e9d8[] = "「サイコー！」の　ノリが　サイコーやん！";

char D_0805ea04[] = "アイツらのコメント";

char D_0805ea18[] = "ほな、　ほんばん　いこか";

char D_0805ea34[] = "またやろうな";

char D_0805ea44[] = "チワッス";

char D_0805ea50[] = "いっしょに　ノろうやないか";

char D_0805ea6c[] = "ノりかた、　おしえるし";

char D_0805ea84[] = "「ウッ」　っていうトコで　Ａボタンや";

char D_0805eaac[] = "ちょっと　きいててな";

char D_0805eac4[] = "わかる？";

char D_0805ead0[] = "ちょっと、　やってみ";

char D_0805eae8[] = "がんばってや";

char D_0805eaf8[] = "「ウッ」　ってトコやで" SHIFT_JIS_WAVE_DASH;

char D_0805eb14[] = "「ウッ」　ってトコやっちゅーに";

char D_0805eb34[] = "ＯＫ！";

char D_0805eb3c[] = "いまのは、　「" ".b" SHIFT_JIS_WAVE_DASH "ですか？" ".8" "」の　ノリやねん";

char D_0805eb6c[] = "こんどは、　「" ".9" SHIFT_JIS_WAVE_DASH "かもネ" ".8" "」の　ノリや";

char D_0805eb94[] = "いっぺん　きいてみてな";

char D_0805ebac[] = "ほな、　がんばってや";

char D_0805ebc4[] = "あといっこ、　「" ".a" SHIFT_JIS_WAVE_DASH "サイコー！！" ".8" "」の　ノリや";

char D_0805ebf4[] = "いっぺん　きいてみてや";

char D_0805ec0c[] = "よしゃ、　がんばってや";

char D_0805ec24[] = "ＯＫ！　ホンマ、　サイコーや";
