#include "global.h"
#include "text.h"


/* Game Text - Bouncy Road */


char D_0805b778[] = "風のウワサ";

char D_0805b784[] = "きほんが　できてないよね。";

char D_0805b7a0[] = "";

char D_0805b7a4[] = "連続ジャンプで　ミスが目立ちすぎよね。";

char D_0805b7cc[] = "連続ジャンプが　ファンタスティックだわ！";

char D_0805b7f8[] = "いい判断だったよね！";

char D_0805b810[] = "かぜのウワサ";

char D_0805b820[] = "きほんが　できてないよね。";

char D_0805b83c[] = "";

char D_0805b840[] = "連続ジャンプで　ミスが目立ちすぎよね。";

char D_0805b868[] = "連続ジャンプが　ファンタスティックだわ！";

char D_0805b894[] = "おちついて判断しないとダメだよね。";

char D_0805b8b8[] = "いい判断だったよね！";

char D_0805b8d0[] = "かぜのウワサ";
