#include "global.h"
#include "text.h"


/* Game Text - Remix 4 */


char D_0806802c[] = "まだまだです。";

char D_0806803c[] = "かなり、　サイコーでーす！";

char D_08068058[] = "はんだん　りょくが　かけてます。";

char D_0806807c[] = "すばらしい　はんだん　りょくだ！";

char D_080680a0[] = "もっと　ウデを　みがこう。";

char D_080680bc[] = "とても　テクニカルだ！";

char D_080680d4[] = "なぞのリズム組織から通達";

char D_080680f0[] =
    "\n"
    "いきます！";

char D_080680fc[] =
    "\n"
    "どうぞ。";

char D_08068108[] =
    "\n"
    "そこまで！！";

char D_08068118[] =
    "\n"
    "ザンネン！！";

char D_08068128[] =
    "\n"
    "おみごと！！";

char D_08068138[] = "ゆっくり　しよか";

char D_0806814c[] =
    "\n"
    "さいごです。";

char D_0806815c[] =
    "\n"
    "さて、 正解は？";
