#include "global.h"
#include "text.h"


/* Game Text - Remix 5 */


char D_0806a230[] = "まだまだです。";

char D_0806a240[] = "かなり、　サイコーでーす！";

char D_0806a25c[] = "はんだん　りょくが　かけてます。";

char D_0806a280[] = "すばらしい　はんだん　りょくだ！";

char D_0806a2a4[] = "もっと　ウデを　みがこう。";

char D_0806a2c0[] = "とても　テクニカルだ！";

char D_0806a2d8[] = "なぞのリズム組織から通達";

char D_0806a2f4[] =
    "\x01\x52" "\x05\x31" "\x01\x35" "♪ WISH 君を待てなくて　";

char D_0806a314[] =
    "\x01\x4c" "　うた　　田中　総史";

char D_0806a32c[] =
    "\x01\x4c" "作詞　作曲\n"
    "　　　　　　　　つんく\n"
    "編曲\n"
    "　　　　　　　　湯浅　公一";

char D_0806a370[] =
    "\x01\x43" "提供　　J.P.ROOM";
