#include "global.h"
#include "text.h"


/* Game Text - Drumming Intro (Unused) 3 */


char D_0805e42c[] =
    "どうも！\n"
    "ドラム侍です。";

char D_0805e444[] = "お元気でしたか？";

char D_0805e458[] = "今回は、　短い曲に合わせて実際に演奏してみましょう。";

char D_0805e490[] = "私の演奏をよくきいて、　マネしてくださいネ。";

char D_0805e4c0[] = "さっそくですが、　いきます。";

char D_0805e4e0[] =
    "ちがう！\n"
    "よくきいてネ。";

char D_0805e4f8[] =
    "ちがうんです！\n"
    "よく、　よ" SHIFT_JIS_WAVE_DASH "くきいてネ。";

char *D_0805e520[] = {
    D_0805e4c0,
    D_0805e4e0,
    D_0805e4f8,
    NULL
};

char D_0805e530[] =
    "\n"
    "あなたの番です。";

char D_0805e544[] =
    "\n"
    "さあ、　いまいちど！";

char D_0805e55c[] =
    "\n"
    "さあ、　こんどこそ！";

char *D_0805e574[] = {
    D_0805e530,
    D_0805e544,
    D_0805e55c,
    NULL
};

char D_0805e584[] =
    "\n"
    "OK!";

char D_0805e58c[] = "";

char D_0805e590[] = "おぉ、　すぐできましたね！";

char D_0805e5ac[] = "なかなか　のみこみが早いですね！";

char D_0805e5d0[] = "いいかんじです。";

char *D_0805e5e4[] = {
    D_0805e58c,
    D_0805e590,
    D_0805e5ac,
    D_0805e5d0,
    NULL
};

char D_0805e5f8[] =
    "次は、　曲のスタートでシンバルをたたいてみましょう。\n"
    "シンバルは、　Rボタンです。";

char D_0805e64c[] = "つまり、　最初だけBボタンとRボタンを同時に押すんです。";

char D_0805e684[] = "曲のスタートの練習を思い出してくださいネ。";

char D_0805e6b0[] = "じゃ、　いきます。";

char *D_0805e6c4[] = {
    D_0805e6b0,
    D_0805e4e0,
    D_0805e4f8,
    NULL
};

char D_0805e6d4[] =
    "すばらしい！\n"
    "その調子です。";

char D_0805e6f0[] = "けっこう　簡単でしたか？";

char D_0805e70c[] = "ちょっと、　苦労しちゃいましたね。";

char *D_0805e730[] = {
    D_0805e58c,
    D_0805e6d4,
    D_0805e6f0,
    D_0805e70c,
    NULL
};

char D_0805e744[] = "では、　曲の終わりをかっこよくキメてみましょう。";

char D_0805e778[] = "お手本、　いきます。";

char *D_0805e790[] = {
    D_0805e778,
    D_0805e4e0,
    D_0805e4f8,
    NULL
};

char D_0805e7a0[] =
    "\n"
    "がんばって！";

char *D_0805e7b0[] = {
    D_0805e7a0,
    D_0805e544,
    D_0805e55c,
    NULL
};

char D_0805e7c0[] =
    "１回で 出来ちゃいましたネ！\n"
    "すごいです！";

char D_0805e7ec[] =
    "たったの２回で　できました！\n"
    "やりますネ！";

char D_0805e818[] =
    "なんとか　出来ましたネ！\n"
    "イイ感じですヨ！";

char *D_0805e844[] = {
    D_0805e58c,
    D_0805e7c0,
    D_0805e7ec,
    D_0805e818,
    NULL
};

char D_0805e858[] = "こんなかんじで、　曲のスタート、　中間、　キメを" SHIFT_JIS_KANJI_HYOU "現できれば楽しく演奏できるのではないかと思います。";

char D_0805e8c0[] = "あのコーナーで練習して、　ぜひ楽しくなってください。";

char D_0805e8f8[] =
    "では、　また。\n"
    "さようなら。";
