#include "global.h"
#include "text.h"


/* Game Text - Drumming Intro (Unused) 2 */


char D_0805d8d8[] =
    "\n"
    "では、　いきます。";

char D_0805d8ec[] =
    "\n"
    "次、　いきます。";

char D_0805d900[] =
    "\n"
    "次は３拍子です。";

char D_0805d914[] =
    "\n"
    "じゃ、　ラスト。";

char D_0805d928[] =
    "\n"
    "以上です。";

char D_0805d934[] =
    "スタートの練習、\n"
    "いかがでしたか？\n"
    "ぜひ、　今後の参考に\n"
    "してくださいネ！";

char D_0805d97c[] =
    "\n"
    "では、　次回をお楽しみに。\n"
    "さようなら。";

char D_0805d9a8[] =
    "\n"
    "あ、　どうも。\n"
    "ドラム侍です。";

char D_0805d9c8[] =
    "えっと…\n"
    "今回は２回目ですね。\n"
    "再会できてうれしいです！";

char D_0805da00[] =
    "さて、　なにごとも最初が\n"
    "肝心な場合が多いですね？\n"
    "演奏なんかも　そうでは\n"
    "ないでしょうか。";

char D_0805da5c[] =
    "レッスン２では\n"
    "スタートの練習をします。";

char D_0805da84[] =
    "私がカウントをするので\n"
    "曲のアタマでＢボタンと\n"
    "Ｒボタン（肩ボタン）を\n"
    "同時に押してください。";
