#include "global.h"
#include "text.h"


/* Game Text - Drumming Intro (Unused) 1 */


char D_0805d438[] =
    "\n"
    "あ、　どうも。\n"
    "ドラム侍です。";

char D_0805d458[] =
    "タイコは　お好きですか？\n"
    "キライじゃないですよね。\n"
    "では、　私が　いろいろと\n"
    "お世話しますね。";

char D_0805d4b4[] =
    "簡単なレクチャーを\n"
    "してさしあげます。\n"
    "まぁ、　気をラクにして\n"
    "おつきあいください。";

char D_0805d508[] =
    "さっそく　レッスン　１　です。\n"
    "私が見本をやりますから\n"
    "マネしてくださいネ。";

char D_0805d554[] =
    "\n"
    "では、　いきます。";

char D_0805d568[] =
    "\n"
    "はい、　どうぞ。";

char D_0805d57c[] =
    "いまのは、　冗談です。\n"
    "ごめんなさい。";

char D_0805d5a4[] =
    "でも、　出来るように\n"
    "精一杯　お世話しますので\n"
    "がんばってみてください。";

char D_0805d5ec[] =
    "\n"
    "では、　次回をお楽しみに。\n"
    "さようなら。";
