#include "global.h"
#include "text.h"


/* Game Text - The Clappy Trio */


char D_0805ad94[] = "きほんが　できてませんね。";

char D_0805adb0[] = "";

char D_0805adb4[] = "ウラが　苦手みたいだね。";

char D_0805add0[] = "ウラが　サイコーです！";

char D_0805ade8[] = "ゆったりするとこが　ヘンだ。";

char D_0805ae08[] = "流れが　みえてる！";

char D_0805ae1c[] = "速いのが　カンペキ！";

char D_0805ae34[] = "仲間のこえ";

char D_0805ae40[] = "きほんが　できてないね。";

char D_0805ae5c[] = "";

char D_0805ae60[] = "ウラが　ニガテみたいだね。";

char D_0805ae7c[] = "ウラが　サイコー！";

char D_0805ae90[] = "ゆったりするとこが　ヘンだ。";

char D_0805aeb0[] = "ながれが　見えてる！";

char D_0805aec8[] = "いそがしくなると　ダメだねぇ…";

char D_0805aee8[] = "いそがしいところが　カンペキ！";

char D_0805af08[] = "なかまの声";

char D_0805af14[] = "オレたち、パチパチ三人衆";

char D_0805af30[] = "等間隔で手拍子をするヨ";

char D_0805af48[] = "あなたは３つめ担当です";

char D_0805af60[] = "では、練習してみましょう";

char D_0805af7c[] = "( Ａボタンで３つめをたたいてネ )";

char D_0805afa0[] = "ＯＫ";

char D_0805afa8[] = "そんなかんじ";

char D_0805afb8[] = "少し、速くしてみます";

char D_0805afd0[] = "OK";

char D_0805afd4[] = "それでは、本番です！";
