#include "global.h"
#include "text.h"


/* Game Text - Space Dance */


char D_0805e2ac[] = "なんだか　乱れてるなぁ。";

char D_0805e2c8[] = "息が　あってるじゃないか！";

char D_0805e2e4[] = "ちょっと　あわててたなぁ。";

char D_0805e300[] = "よい判断をしてるじゃないか！";

char D_0805e320[] = "サビの手前が　ガタガタだったなぁ。";

char D_0805e344[] = "サビの手前が　キマってたヨ！";

char D_0805e364[] = "スペースおじさんの意見";

char D_0805e37c[] = "レッツゴー！";

char D_0805e38c[] = "みんなで　ダンスするぞ。";

char D_0805e3a8[] = "まず、　３つの　アクションを　おぼえるのだ。";

char D_0805e3d8[] = "では、　１つめ。";

char D_0805e3ec[] = "マネするのだ！";

char D_0805e3fc[] = "ＯＫ！";

char D_0805e404[] = "つぎ";

char D_0805e40c[] = "ラスト";

char D_0805e414[] = "では、　ほんばんだ！";
