#include "global.h"
#include "text.h"


/* Game Text - Tap Trial */


char D_0805c0d0[] = "きほんが　できてませんね。";

char D_0805c0ec[] = "適応" SHIFT_JIS_KANJI_NOU "力　良いです！";

char D_0805c104[] = "判断力が欠けてます。";

char D_0805c11c[] = "たいした判断力だ！";

char D_0805c130[] = "もっと集中しよう。";

char D_0805c144[] = "すごい集中力ですよ！";

char D_0805c15c[] = "ツメが甘いです。";

char D_0805c170[] = "";

char D_0805c174[] = "ほんばん　スタート！";

char D_0805c18c[] = "チェックしちゃうもんね。";

char D_0805c1a8[] = "おつかれちゃん。";

char D_0805c1bc[] = "タップしましょ！";

char D_0805c1d0[] = "まず、　れんしゅう。";

char D_0805c1e8[] = "マネしてね。";

char D_0805c1f8[] = "ＯＫ！　つぎでーす。";

char D_0805c210[] = "ＯＫ！　まだあるヨ。";

char D_0805c228[] = "ＯＫ！　ラストです。";

char D_0805c240[] = "ＯＫ！";

char D_0805c248[] = "きほんが　できてないかも…";

char D_0805c264[] = "なじんでるネ！";

char D_0805c274[] = "判断力が　たりないかも…";

char D_0805c290[] = "たいした　判断力だヨ！";

char D_0805c2a8[] = "もっと集中しよう。";

char D_0805c2bc[] = "すごい集中力だヨ" SHIFT_JIS_WAVE_DASH "！";

char D_0805c2d4[] = "ツメが甘いかも。";

char D_0805c2e8[] = "";

char D_0805c2ec[] = "サルの　ひとこと";

char D_0805c300[] = "ほんばん　スタート！";

char D_0805c318[] = "チェックしちゃうもんね。";

char D_0805c334[] = "おつかれちゃん。";

char D_0805c348[] = "タップしましょ！";

char D_0805c35c[] = "まず、　れんしゅう。";

char D_0805c374[] = "マネしてね。";

char D_0805c384[] = "ＯＫ！　つぎでーす。";

char D_0805c39c[] = "ＯＫ！　まだあるヨ。";

char D_0805c3b4[] = "ＯＫ！　ラストです。";

char D_0805c3cc[] = "ＯＫ！";
